In [13]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [14]:
from pandas import Series, DataFrame
import numpy as np
import pandas as pd

## Series

In [15]:
# series 由一组数据与一组与之相关联的数据标签（索引）组成
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [16]:
obj.values
obj.index
obj.index = ['a', 'b', 'c', 'd'] # Series的索引可以通过赋值进行改变
obj

array([ 4,  7, -5,  3])

RangeIndex(start=0, stop=4, step=1)

a    4
b    7
c   -5
d    3
dtype: int64

In [17]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

In [18]:
obj2['a']
obj2['b'] = 3
obj2
obj2[['a', 'b']]

-5

d    4
b    3
a   -5
c    3
dtype: int64

a   -5
b    3
dtype: int64

In [19]:
obj2[obj2 > 1]
obj2 * 2
np.exp(obj2)

d    4
b    3
c    3
dtype: int64

d     8
b     6
a   -10
c     6
dtype: int64

d    54.598150
b    20.085537
a     0.006738
c    20.085537
dtype: float64

In [20]:
'b' in obj2
'e' in obj2

True

False

In [21]:
sdata = {'ohio': 35000, 'texas': 71000, 'oregon': 16000, 'utah': 5000}
obj3 = Series(sdata)
obj3

ohio      35000
oregon    16000
texas     71000
utah       5000
dtype: int64

In [22]:
state = ['texas', 'ohio', 'utah', 'california']
obj4 = Series(sdata, index=state)
obj4

texas         71000.0
ohio          35000.0
utah           5000.0
california        NaN
dtype: float64

In [23]:
pd.isnull(obj4)
pd.notnull(obj4) # 检测缺失值
obj4.isnull()

texas         False
ohio          False
utah          False
california     True
dtype: bool

texas          True
ohio           True
utah           True
california    False
dtype: bool

texas         False
ohio          False
utah          False
california     True
dtype: bool

In [24]:
obj3
obj4
obj3 + obj4 # Series数据在运算时能自动对齐索引

ohio      35000
oregon    16000
texas     71000
utah       5000
dtype: int64

texas         71000.0
ohio          35000.0
utah           5000.0
california        NaN
dtype: float64

california         NaN
ohio           70000.0
oregon             NaN
texas         142000.0
utah           10000.0
dtype: float64

In [25]:
obj4.name = 'population'
obj4.index.name = 'state' # Series对象及其索引具有name属性
obj4

state
texas         71000.0
ohio          35000.0
utah           5000.0
california        NaN
Name: population, dtype: float64

## DataFrame

### 创建dataframe

In [26]:
data = {'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada'], 'year': [2000, 2001, 2002, 2001, 2002], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002

In [27]:
DataFrame(data, columns=['year', 'state', 'pop']) # columns可以指定列的顺序

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9

In [28]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame2 # NaN补齐无数据的column
frame2.columns

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN

Index(['year', 'state', 'pop', 'debt'], dtype='object')

###  索引列，对列赋值，新增列，删除列

In [29]:
frame2['state'] #索引
frame2.year #属性的方式

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
Name: state, dtype: object

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [30]:
frame2['debt'] = 16.5
frame2
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0

In [31]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7

In [32]:
frame2['eastern'] = frame2.state == 'ohio' # 创建新列
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2002    ohio  3.6   NaN     True
four   2001  nevada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False

In [33]:
del frame2['eastern']  # 删除列
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

### 索引行

In [34]:
# frame2[3] # error
frame2.iloc[3]
frame2.loc['two']

year       2001
state    nevada
pop         2.4
debt       -1.5
Name: four, dtype: object

year     2001
state    ohio
pop       1.7
debt     -1.2
Name: two, dtype: object

In [35]:
pop = {'nevada': {2001: 2.4, 2002: 2.9}, 'ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop) # 外层字典的key作为column，内层字典的key作为index
frame3

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [36]:
frame3.T
DataFrame(pop, index=[2001, 2002, 2003])

        2000  2001  2002
nevada   NaN   2.4   2.9
ohio     1.5   1.7   3.6

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [37]:
frame4 = DataFrame({'ohio': frame3['ohio'][:-1], 'nevada': frame3['nevada'][:2]}) 
type(frame4['nevada'])
# dataFrame列的数据类型是Series
frame4

pandas.core.series.Series

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7

In [38]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [39]:
frame2.values # 以ndarray的形式返回数据
frame3.values # 数据类型不同

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7]], dtype=object)

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

## Series & DataFrame的索引

### Index对象

In [12]:
obj = Series(range(3), index=['a', 'b', 'c'])
obj.index  # index是不可变的，不能对其赋值，obj.index[2] = 'd'，error
obj.index[1:]

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

In [51]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, 2.3, 3.7], index=index)
obj2

0    1.5
1    2.3
2    3.7
dtype: float64

In [52]:
frame3
'ohio' in frame3.columns
2003 in frame3.index

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

True

False

### reindex

In [54]:
obj = Series([4.5, 7.2, 3.7, 9.1], index=['d', 'a', 'b', 'c'])
obj
obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj.reindex(['a', 'b', 'c', 'e'], fill_value=0)

d    4.5
a    7.2
b    3.7
c    9.1
dtype: float64

a    7.2
b    3.7
c    9.1
d    4.5
e    NaN
dtype: float64

a    7.2
b    3.7
c    9.1
e    0.0
dtype: float64

In [55]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill') # 以上一个值补充index

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

|reindex插值|说明|
|--|--|
|ffill/pad|同前一个值|
|bfill/backfill|同后一个值|

In [53]:
frame = DataFrame(np.arange(9).reshape(3, 3), index=['a', 'c', 'd'], columns=['ohio', 'texas', 'california'])
frame
frame2 = frame.reindex(['a', 'b', 'c', 'd']) # reindex默认对行
frame2

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

   ohio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [54]:
states = ['texas', 'utah', 'california']
frame.reindex(columns=states)
frame

   texas  utah  california
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

   ohio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [58]:
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states)
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states).ffill()
# frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)  # error
# 可以同时对index和column进行reindex，填充空白值只能针对行

   california  utah  texas
a         2.0   NaN    1.0
b         NaN   NaN    NaN
c         5.0   NaN    4.0
d         8.0   NaN    7.0

   california  utah  texas
a         2.0   NaN    1.0
b         2.0   NaN    1.0
c         5.0   NaN    4.0
d         8.0   NaN    7.0

In [77]:
frame.loc[['a', 'c'], states]
frame.loc[['a', 'c']]

   texas  utah  california
a    1.0   NaN         2.0
c    4.0   NaN         5.0

   ohio  texas  california
a     0      1           2
c     3      4           5

### drop 丢弃 删除

In [79]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
newObj = obj.drop('c')
newObj
obj.drop(['d', 'c'])

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [80]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['ohio', 'utha', 'california', 'texas'], columns=['one', 'two', 'three', 'four'])
data
data.drop(['texas', 'ohio'])
data.drop('two', axis=1)
data.drop(['two', 'four'], axis=1)

            one  two  three  four
ohio          0    1      2     3
utha          4    5      6     7
california    8    9     10    11
texas        12   13     14    15

            one  two  three  four
utha          4    5      6     7
california    8    9     10    11

            one  three  four
ohio          0      2     3
utha          4      6     7
california    8     10    11
texas        12     14    15

            one  three
ohio          0      2
utha          4      6
california    8     10
texas        12     14

### 索引 选取 过滤

In [61]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']
obj[1]
obj[2:4]
obj[['b', 'a', 'c']]
obj[[1, 3]]
obj[obj < 2]

1.0

1.0

c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
c    2.0
dtype: float64

b    1.0
d    3.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [86]:
obj['b':'d'] # 利用标签进行切片，与python切片运算不同，其包含末端
obj['b':'c'] = 7 # 切片赋值
obj

b    7.0
c    7.0
d    3.0
dtype: float64

a    0.0
b    7.0
c    7.0
d    3.0
dtype: float64

In [65]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['ohio', 'utha', 'california', 'texas'], columns=['one', 'two', 'three', 'four'])
data['two']
data[['three', 'one']]
data[:2]
data[data['three'] > 5]

ohio           1
utha           5
california     9
texas         13
Name: two, dtype: int64

            three  one
ohio            2    0
utha            6    4
california     10    8
texas          14   12

      one  two  three  four
ohio    0    1      2     3
utha    4    5      6     7

            one  two  three  four
utha          4    5      6     7
california    8    9     10    11
texas        12   13     14    15

In [89]:
data < 5
data[data < 5] = 0
data

              one    two  three   four
ohio         True   True   True   True
utha         True  False  False  False
california  False  False  False  False
texas       False  False  False  False

            one  two  three  four
ohio          0    0      0     0
utha          0    5      6     7
california    8    9     10    11
texas        12   13     14    15

#### loc  iloc

In [104]:
data
data.loc['utha', ['two', 'three']]
data.iloc[[3, 2], [3, 0, 1]]
data.iloc[2]
data.loc[:'california', 'three']
data.loc[data.three > 5].iloc[:,:3]

            one  two  three  four
ohio          0    0      0     0
utha          0    5      6     7
california    8    9     10    11
texas        12   13     14    15

two      5
three    6
Name: utha, dtype: int64

            four  one  two
texas         15   12   13
california    11    8    9

one       8
two       9
three    10
four     11
Name: california, dtype: int64

ohio           0
utha           6
california    10
Name: three, dtype: int64

            one  two  three
utha          0    5      6
california    8    9     10
texas        12   13     14

#### index有重复值时的索引

In [70]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj
obj.index.is_unique # index的属性is_unique
obj['a'] # type: Series
obj['c'] # type: value
frame = DataFrame(np.random.rand(4, 3), index=['a', 'a', 'b', 'b'])
frame.loc['b']

a    0
a    1
b    2
b    3
c    4
dtype: int64

False

a    0
a    1
dtype: int64

4

          0         1         2
b  0.089941  0.610291  0.430252
b  0.414688  0.974825  0.881841

### 算术运算和数据对齐

In [71]:
s1 = Series([7, 3, 5, 9], index=['a', 'b', 'c', 'd'])
s2 = Series([1, 2, 3, 4, 5], index=['a', 'c', 'e', 'f', 'g'])
s1 + s2 # 按索引取并集，对称差部分以NaN补充

a    8.0
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [72]:
d1 = DataFrame(np.arange(9).reshape((3, 3)), columns=list('bcd'), index=['ohio', 'texas', 'utha'])
d2 = DataFrame(np.arange(12).reshape((4, 3)), columns=list('bde'), index=['ohio', 'texas', 'oregon', 'california'])
d1 + d2 # 取索引和列的并集

              b   c    d   e
california  NaN NaN  NaN NaN
ohio        0.0 NaN  3.0 NaN
oregon      NaN NaN  NaN NaN
texas       6.0 NaN  9.0 NaN
utha        NaN NaN  NaN NaN

In [76]:
d1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
d2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
d1 + d2
d1.add(d2, fill_value=0)
d1.reindex(columns=d2.columns, fill_value=0)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

|算术运算|说明|
|--|--|
|add|+|
|sub|-|
|div|/|
|mul|*|

### dataframe与series的运算

In [78]:
arr = np.arange(12.).reshape((3, 4))
arr
arr[0]
arr - arr[0] # 每一行都被减了arr[0]，称为broadcasting

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

array([ 0.,  1.,  2.,  3.])

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [80]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['utah', 'texas', 'ohio', 'oregon'])
series = frame.iloc[0]
frame
series
frame - series

          b     d     e
utah    0.0   1.0   2.0
texas   3.0   4.0   5.0
ohio    6.0   7.0   8.0
oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: utah, dtype: float64

          b    d    e
utah    0.0  0.0  0.0
texas   3.0  3.0  3.0
ohio    6.0  6.0  6.0
oregon  9.0  9.0  9.0

In [81]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
utah    0.0 NaN   3.0 NaN
texas   3.0 NaN   6.0 NaN
ohio    6.0 NaN   9.0 NaN
oregon  9.0 NaN  12.0 NaN

In [82]:
series3 = frame['d']
frame.sub(series3, axis=0) # 将series的索引匹配到frame的行索引，沿着列进行广播

          b    d    e
utah   -1.0  0.0  1.0
texas  -1.0  0.0  1.0
ohio   -1.0  0.0  1.0
oregon -1.0  0.0  1.0

### apply map

In [40]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['texas', 'utha', 'ohio', 'oregon'])
np.abs(frame)

               b         d         e
texas   0.178094  0.801863  0.822762
utha    0.391433  0.061967  2.047769
ohio    0.338678  0.114927  2.247328
oregon  0.238361  0.919440  1.623052

In [41]:
f = lambda x: x.max() - x.min()
frame
frame.apply(f) # apply默认对行进行
frame.apply(f, axis=1)

               b         d         e
texas  -0.178094 -0.801863  0.822762
utha    0.391433  0.061967 -2.047769
ohio   -0.338678  0.114927 -2.247328
oregon  0.238361 -0.919440 -1.623052

b    0.730111
d    1.034367
e    3.070090
dtype: float64

texas     1.624625
utha      2.439202
ohio      2.362255
oregon    1.861413
dtype: float64

In [91]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
a = frame.apply(f)
type(a)
a

pandas.core.frame.DataFrame

            b         d         e
min -0.534262 -2.199527 -0.055326
max  0.777264  1.352555  0.699100

In [92]:
format = lambda x: '%.2f' % x
frame.applymap(format) # DataFrame应用applymap函数作用于每一个元素
frame['e'].map(format) # Series应用map函数作用于每一个元素

            b      d      e
texas    0.61   1.35   0.70
utha     0.38  -2.20   0.35
ohio    -0.53  -0.38   0.33
oregon   0.78   0.40  -0.06

texas      0.70
utha       0.35
ohio       0.33
oregon    -0.06
Name: e, dtype: object

### 排序 排名

In [93]:
obj = Series(range(4), index=['d', 'a', 'c', 'b'])
obj.sort_index()

a    1
b    3
c    2
d    0
dtype: int64

In [103]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'c', 'a', 'b'])
frame
frame.sort_index()
frame.sort_index(axis=1)
frame.sort_index(axis=1, ascending=False)

       d  c  a  b
three  0  1  2  3
one    4  5  6  7

       d  c  a  b
one    4  5  6  7
three  0  1  2  3

       a  b  c  d
three  2  3  1  0
one    6  7  5  4

       d  c  b  a
three  0  1  3  2
one    4  5  7  6

In [101]:
obj = Series([1.5, 6.2, 9.1, 2.7])
obj.sort_values() # 对值进行排序

obj = Series([1.5, np.nan, 6.2, 9.1, np.nan, 2.7])
obj.sort_values() # nan排序后放在末尾

0    1.5
3    2.7
1    6.2
2    9.1
dtype: float64

0    1.5
5    2.7
2    6.2
3    9.1
1    NaN
4    NaN
dtype: float64

In [106]:
frame = DataFrame({'b': [3, 7, 2, 1], 'a': [7, 9, 10, 3]})
frame
frame.sort_values(by='b')
frame.sort_values(by=['a', 'b']) # 先以a列，在a列基础上以b列

    a  b
0   7  3
1   9  7
2  10  2
3   3  1

    a  b
3   3  1
2  10  2
0   7  3
1   9  7

    a  b
3   3  1
0   7  3
1   9  7
2  10  2

In [107]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank() # 给出排序值，rank的method有average(default)，min，max，first
obj.rank(method='first')
obj.rank(ascending=False, method='max')

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [108]:
frame = DataFrame({'b': [3, 7, 2, 1], 'a': [8, 9, 7, 2], 'c': [6, 9, 5, 4]})
frame.rank(axis=1)

     a    b    c
0  3.0  1.0  2.0
1  2.5  1.0  2.5
2  3.0  1.0  2.0
3  2.0  1.0  3.0

### 描述性统计

In [4]:
df = DataFrame([[1.5, np.nan], [1.7, 2.9], [np.nan, np.nan], [0.29, -3.8]], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df
df.sum() # na值被忽略，只对非na起作用
df.sum(axis=0)
df.sum(axis=1)

    one  two
a  1.50  NaN
b  1.70  2.9
c   NaN  NaN
d  0.29 -3.8

one    3.49
two   -0.90
dtype: float64

one    3.49
two   -0.90
dtype: float64

a    1.50
b    4.60
c    0.00
d   -3.51
dtype: float64

In [5]:
df.mean(axis=1, skipna=False)
df.idxmax()
df.idxmin()
df.cumsum() # axis默认是0，按行进行
df.describe()

a      NaN
b    2.300
c      NaN
d   -1.755
dtype: float64

one    b
two    b
dtype: object

one    d
two    d
dtype: object

    one  two
a  1.50  NaN
b  3.20  2.9
c   NaN  NaN
d  3.49 -0.9

            one       two
count  3.000000  2.000000
mean   1.163333 -0.450000
std    0.762911  4.737615
min    0.290000 -3.800000
25%    0.895000 -2.125000
50%    1.500000 -0.450000
75%    1.600000  1.225000
max    1.700000  2.900000

In [7]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj
obj.describe()

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

count     16
unique     3
top        a
freq       8
dtype: object

|描述性统计方法|说明|
|--|--|
|argmin/argmax|最小/大值的索引位置（整数）|
|idxmin/idxmax|最小/大值的索引值|
|mad|平均绝对离差|
|skew|偏度|
|kurt|峰度|
|diff|一阶差分|
|pct_change|百分比变化|

In [42]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

type(all_data)
all_data.columns

price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['volume'] for tic, data in all_data.iteritems()})

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

In [43]:
import pandas-datareader

SyntaxError: invalid syntax (<ipython-input-43-b888aaa77909>, line 1)

In [ ]:
returns = price.pct_change()
returns.tail()

returns.MSFT.corr(returns.IBM) # Series的corr
returns.MSFT.cov(returns.IBM)

returns.corr() # DataFrame的corr
returns.cov() # 协方差矩阵

returns.corrwith(returns.IBM)

returns.corrwith(volume)

In [49]:
obj = Series(['c', 'd', 'a', 'c', 'd', 'b', 'c'])
uniques = obj.unique()
uniques

uniques.sort()
uniques

obj.value_counts() # 计数
pd.value_counts(obj.values, sort=False)

array(['c', 'd', 'a', 'b'], dtype=object)

array(['a', 'b', 'c', 'd'], dtype=object)

c    3
d    2
a    1
b    1
dtype: int64

b    1
c    3
d    2
a    1
dtype: int64

In [50]:
mask = obj.isin(['b', 'd'])
mask
obj[mask]

0    False
1     True
2    False
3    False
4     True
5     True
6    False
dtype: bool

1    d
4    d
5    b
dtype: object